/**
 * MB-V1.1 Number Handler
 *
 * Handle:
 *
 * NUM:0
 * NUM:1
 * ...
 * NUM:9
 */


namespace MBNumberHandler {


    export function execute(
        value: string
    ): boolean {

        switch (value) {

            case "0":
                return true

            case "1":
                /**
      * PCA9685 + L298N 底层测试
      *
      * 硬件：
      *   PCA9685 + L298N
      *
      * 电机：
      *   0 = 左轮
      *   1 = 右轮
      *
      * 测试内容：
      *   1. 左轮正转
      *   2. 左轮停止
      *   3. 左轮反转
      *   4. 左轮停止
      *   5. 左轮速度测试
      *   6. 右轮正转
      *   7. 右轮停止
      *   8. 右轮反转
      *   9. 右轮停止
      *   10. 双轮正转
      *   11. 双轮停止
      *   12. 双轮反转
      *   13. 双轮停止
      *   14. 刹车测试
      */

                //==================================================
                // PCA9685 + L298N 测试
                //==================================================

                // 初始化

                PCA_L298N.init()

                basic.pause(1000)


                //==================================================
                // 测试 1
                // 左轮正转 50%
                //==================================================

                basic.showString("L F")

                PCA_L298N.forward(
                    0,
                    50
                )

                basic.pause(3000)


                //==================================================
                // 左轮停止
                //==================================================

                PCA_L298N.stop(0)

                basic.pause(2000)


                //==================================================
                // 测试 2
                // 左轮反转 50%
                //==================================================

                basic.showString("L R")

                PCA_L298N.reverse(
                    0,
                    50
                )

                basic.pause(3000)


                //==================================================
                // 左轮停止
                //==================================================

                PCA_L298N.stop(0)

                basic.pause(2000)


                //==================================================
                // 测试 3
                // 左轮速度测试
                //==================================================

                basic.showString("L SPD")

                PCA_L298N.forward(
                    0,
                    20
                )

                basic.pause(2000)

                PCA_L298N.forward(
                    0,
                    40
                )

                basic.pause(2000)

                PCA_L298N.forward(
                    0,
                    60
                )

                basic.pause(2000)

                PCA_L298N.forward(
                    0,
                    80
                )

                basic.pause(2000)

                PCA_L298N.forward(
                    0,
                    100
                )

                basic.pause(2000)

                PCA_L298N.stop(0)

                basic.pause(2000)


                //==================================================
                // 测试 4
                // 右轮正转 50%
                //==================================================

                basic.showString("R F")

                PCA_L298N.forward(
                    1,
                    50
                )

                basic.pause(3000)


                //==================================================
                // 右轮停止
                //==================================================

                PCA_L298N.stop(1)

                basic.pause(2000)


                //==================================================
                // 测试 5
                // 右轮反转 50%
                //==================================================

                basic.showString("R R")

                PCA_L298N.reverse(
                    1,
                    50
                )

                basic.pause(3000)


                //==================================================
                // 右轮停止
                //==================================================

                PCA_L298N.stop(1)

                basic.pause(2000)


                //==================================================
                // 测试 6
                // 右轮速度测试
                //==================================================

                basic.showString("R SPD")

                PCA_L298N.forward(
                    1,
                    20
                )

                basic.pause(2000)

                PCA_L298N.forward(
                    1,
                    40
                )

                basic.pause(2000)

                PCA_L298N.forward(
                    1,
                    60
                )

                basic.pause(2000)

                PCA_L298N.forward(
                    1,
                    80
                )

                basic.pause(2000)

                PCA_L298N.forward(
                    1,
                    100
                )

                basic.pause(2000)

                PCA_L298N.stop(1)

                basic.pause(2000)


                //==================================================
                // 测试 7
                // 双轮正转
                //==================================================

                basic.showString("B F")

                PCA_L298N.forward(
                    0,
                    50
                )

                PCA_L298N.forward(
                    1,
                    50
                )

                basic.pause(3000)


                //==================================================
                // 双轮停止
                //==================================================

                PCA_L298N.stop(0)
                PCA_L298N.stop(1)

                basic.pause(2000)


                //==================================================
                // 测试 8
                // 双轮反转
                //==================================================

                basic.showString("B R")

                PCA_L298N.reverse(
                    0,
                    50
                )

                PCA_L298N.reverse(
                    1,
                    50
                )

                basic.pause(3000)


                //==================================================
                // 双轮停止
                //==================================================

                PCA_L298N.stop(0)
                PCA_L298N.stop(1)

                basic.pause(2000)


                //==================================================
                // 测试 9
                // 刹车
                //==================================================

                basic.showString("BRAKE")

                PCA_L298N.forward(
                    0,
                    70
                )

                PCA_L298N.forward(
                    1,
                    70
                )

                basic.pause(2000)

                PCA_L298N.brake(0)
                PCA_L298N.brake(1)

                basic.pause(3000)


                //==================================================
                // 测试完成
                //==================================================

                PCA_L298N.stop(0)
                PCA_L298N.stop(1)

                basic.showString("OK")    
                
                return true

            case "2":
            
           
                return true

            case "3":
                return true

            case "4":
    

                return true

            case "5":
              
                return true

            case "6":
           
                return true

            case "7":
                return true

            case "8":
                return true

            case "9":
                return true

            default:
                basic.showString(
                    "ERR"
                )
                return false
        }

    }


}