/**
 * 电机控制
 *
 * MBMotor 是面向 MakeCode 用户的电机控制接口。
 *
 * 底层硬件：
 *
 * MBMotor
 *    ↓
 * L298N
 *    ↓
 * PCA9685
 *    ↓
 * L298N
 *    ↓
 * Motor
 */

//% color=#E91E63 icon="\uf1b9" weight=80
namespace MBMotor {

    //==================================================
    // 电机编号
    //==================================================

    /**
     * 电机编号
     */
    export enum Motor {
        A = 0,
        B = 1
    }


    //==================================================
    // 当前速度
    //==================================================

    /**
     * 保存当前电机速度
     *
     * -100 ~ 100
     *
     * 正数：正转
     * 负数：反转
     * 0：停止
     */
    let motorSpeed: number[] = [
        0,
        0
    ]


    //==================================================
    // 初始化
    //==================================================

    /**
     * 初始化电机驱动器
     */
    //% block="初始化电机"
    export function init(): void {

        L298N.init()

        motorSpeed[Motor.A] = 0
        motorSpeed[Motor.B] = 0
    }


    //==================================================
    // 设置电机速度
    //==================================================

    /**
     * 设置电机速度
     *
     * speed:
     *
     *  0 ~ 100  → 正转
     * -1 ~ -100 → 反转
     *  0        → 停止
     */
    //% block="设置电机 %motor 速度为 %speed %%"
    //% speed.min=-100 speed.max=100
    //% speed.defl=50
    export function setSpeed(
        motor: Motor,
        speed: number
    ): void {

        //==================================================
        // 限制速度范围
        //==================================================

        if (speed > 100)
            speed = 100

        if (speed < -100)
            speed = -100


        //==================================================
        // 保存当前速度
        //==================================================

        motorSpeed[motor] = speed


        //==================================================
        // 发送给 L298N
        //==================================================

        L298N.setSpeed(
            motor,
            speed
        )
    }


    //==================================================
    // 获取当前速度
    //==================================================

    /**
     * 获取电机当前速度
     *
     * 正数：正转
     * 负数：反转
     * 0：停止
     */
    export function getSpeed(
        motor: Motor
    ): number {

        return motorSpeed[motor]
    }


    //==================================================
    // 停止电机
    //==================================================

    /**
     * 停止电机
     */
    //% block="停止电机 %motor"
    export function stop(
        motor: Motor
    ): void {

        motorSpeed[motor] = 0

        L298N.stop(
            motor
        )
    }


    //==================================================
    // 电机正转
    //==================================================

    /**
     * 电机正转
     *
     * 默认速度：50%
     */
    //% block="电机 %motor 正转"
    export function forward(
        motor: Motor
    ): void {

        setSpeed(
            motor,
            100
        )
    }


    //==================================================
    // 电机反转
    //==================================================

    /**
     * 电机反转
     *
     * 默认速度：50%
     */
    //% block="电机 %motor 反转"
    export function reverse(
        motor: Motor
    ): void {

        setSpeed(
            motor,
            -100
        )
    }


    //==================================================
    // 电机制动
    //==================================================

    /**
     * 电机主动刹车
     */
    //% block="刹车电机 %motor"
    export function brake(
        motor: Motor
    ): void {

        motorSpeed[motor] = 0

        L298N.brake(
            motor
        )
    }
}